tefilus/DATN_backup/SIMULINK/mcb_pmsm_foc_qep_dyno_f28069m_ert_rtw/mcb_pmsm_foc_qep_dyno_f28069m.h
/*
 * File: mcb_pmsm_foc_qep_dyno_f28069m.h
 *
 * Code generated for Simulink model 'mcb_pmsm_foc_qep_dyno_f28069m'.
 *
 * Model version                  : 7.4
 * Simulink Coder version         : 23.2 (R2023b) 01-Aug-2023
 * C/C++ source code generated on : Wed Mar 12 10:05:43 2025
 *
 * Target selection: ert.tlc
 * Embedded hardware selection: Texas Instruments->C2000
 * Code generation objectives: Unspecified
 * Validation result: Not run
 */

#ifndef RTW_HEADER_mcb_pmsm_foc_qep_dyno_f28069m_h_
#define RTW_HEADER_mcb_pmsm_foc_qep_dyno_f28069m_h_
#ifndef mcb_pmsm_foc_qep_dyno_f28069m_COMMON_INCLUDES_
#define mcb_pmsm_foc_qep_dyno_f28069m_COMMON_INCLUDES_
#include "rtwtypes.h"
#include "c2000BoardSupport.h"
#include "F2806x_Device.h"
#include "F2806x_Gpio.h"
#include "DSP28xx_SciUtil.h"
#include "F2806x_Examples.h"
#include "IQmathLib.h"
#include "MW_SPI.h"
#endif                      /* mcb_pmsm_foc_qep_dyno_f28069m_COMMON_INCLUDES_ */

#include "MW_c2000ISR.h"
#include "mcb_pmsm_foc_qep_dyno_f28069m_types.h"
#include "rt_nonfinite.h"
#include "rtGetNaN.h"
#include <string.h>
#include <stddef.h>
#include "MW_target_hardware_resources.h"

/* Macros for accessing real-time model data structure */
#ifndef rtmGetErrorStatus
#define rtmGetErrorStatus(rtm)         ((rtm)->errorStatus)
#endif

#ifndef rtmSetErrorStatus
#define rtmSetErrorStatus(rtm, val)    ((rtm)->errorStatus = (val))
#endif

#ifndef rtmStepTask
#define rtmStepTask(rtm, idx)          ((rtm)->Timing.TaskCounters.TID[(idx)] == 0)
#endif

#ifndef rtmTaskCounter
#define rtmTaskCounter(rtm, idx)       ((rtm)->Timing.TaskCounters.TID[(idx)])
#endif

#define mcb_pmsm_foc_qep_dyno_f28069m_M (mcb_pmsm_foc_qep_dyno_f28069_M)

extern void init_SCI(void);
extern void init_SCI_GPIO(void);
extern void config_ePWM_GPIO (void);
extern void config_ePWM_TBSync (void);
extern void config_ePWM_XBAR(void);

/* Block signals for system '<S36>/Two phase CRL wrap' */
typedef struct {
  real32_T a_plus_2b;                  /* '<S37>/a_plus_2b' */
  real32_T one_by_sqrt3;               /* '<S37>/one_by_sqrt3' */
  real32_T algDD_o1;
  real32_T algDD_o2;
} rtB_TwophaseCRLwrap_mcb_pmsm_fo;

/* Block signals for system '<S38>/D//Q Axis Priority' */
typedef struct {
  real32_T Switch[2];                  /* '<S42>/Switch' */
  real32_T Switch2;                    /* '<S52>/Switch2' */
  real32_T Product;                    /* '<S51>/Product' */
  real32_T Sum;                        /* '<S51>/Sum' */
  real32_T Product2;                   /* '<S51>/Product2' */
  real32_T Merge;                      /* '<S51>/Merge' */
  real32_T Gain;                       /* '<S51>/Gain' */
  real32_T Switch_f;                   /* '<S52>/Switch' */
  real32_T Switch1;                    /* '<S53>/Switch1' */
  real32_T Sqrt;                       /* '<S53>/Sqrt' */
  real32_T Gain_j;                     /* '<S53>/Gain' */
  uint16_T DataTypeConversion;         /* '<S51>/Data Type Conversion' */
  boolean_T Compare;                   /* '<S47>/Compare' */
  boolean_T Compare_f;                 /* '<S48>/Compare' */
  boolean_T LowerRelop1;               /* '<S52>/LowerRelop1' */
  boolean_T RelationalOperator;        /* '<S51>/Relational Operator' */
  boolean_T UpperRelop;                /* '<S52>/UpperRelop' */
} rtB_DQAxisPriority_mcb_pmsm_foc;

/* Block signals for system '<S38>/D-Q Equivalence' */
typedef struct {
  real32_T Product[2];                 /* '<S45>/Product' */
  real32_T SquareRoot;                 /* '<S45>/Square Root' */
  real32_T Switch;                     /* '<S45>/Switch' */
  real32_T Reciprocal;                 /* '<S45>/Reciprocal' */
  uint16_T DataTypeConversion;         /* '<S41>/Data Type Conversion' */
  boolean_T RelationalOperator;        /* '<S41>/Relational Operator' */
} rtB_DQEquivalence_mcb_pmsm_foc_;

/* Block signals for system '<S32>/Two inputs CRL' */
typedef struct {
  real32_T qcos;                       /* '<S157>/qcos' */
  real32_T dsin;                       /* '<S157>/dsin' */
  real32_T sum_beta;                   /* '<S157>/sum_beta' */
  real32_T dcos;                       /* '<S157>/dcos' */
  real32_T qsin;                       /* '<S157>/qsin' */
  real32_T sum_alpha;                  /* '<S157>/sum_alpha' */
  real32_T Switch[2];                  /* '<S158>/Switch' */
  real32_T algDD_o1;
  real32_T algDD_o2;
} rtB_TwoinputsCRL_mcb_pmsm_foc_q;

/* Block signals for system '<S33>/Two inputs CRL' */
typedef struct {
  real32_T acos_n;                     /* '<S159>/acos' */
  real32_T bsin;                       /* '<S159>/bsin' */
  real32_T sum_Ds;                     /* '<S159>/sum_Ds' */
  real32_T bcos;                       /* '<S159>/bcos' */
  real32_T asin_p;                     /* '<S159>/asin' */
  real32_T sum_Qs;                     /* '<S159>/sum_Qs' */
  real32_T Switch[2];                  /* '<S160>/Switch' */
  real32_T algDD_o1;
  real32_T algDD_o2;
} rtB_TwoinputsCRL_mcb_pmsm_foc_o;

/* Block signals for system '<S162>/If Action Subsystem' */
typedef struct {
  real32_T Convert_back;               /* '<S164>/Convert_back' */
  int16_T Convert_uint16;              /* '<S164>/Convert_uint16' */
} rtB_IfActionSubsystem_mcb_pmsm_;

/* Block signals for system '<S162>/If Action Subsystem1' */
typedef struct {
  real32_T Convert_back;               /* '<S165>/Convert_back' */
  int16_T Convert_uint16;              /* '<S165>/Convert_uint16' */
} rtB_IfActionSubsystem1_mcb_pmsm;

/* Block signals for system '<S190>/IndexFinder' */
typedef struct {
  uint16_T Delay3;                     /* '<S193>/Delay3' */
  boolean_T Compare;                   /* '<S200>/Compare' */
  boolean_T Compare_k;                 /* '<S201>/Compare' */
  boolean_T AND;                       /* '<S193>/AND' */
} rtB_IndexFinder_mcb_pmsm_foc_qe;

/* Block states (default storage) for system '<S190>/IndexFinder' */
typedef struct {
  uint16_T Delay3_DSTATE;              /* '<S193>/Delay3' */
} rtDW_IndexFinder_mcb_pmsm_foc_q;

/* Block signals for system '<S195>/PositionNoReset' */
typedef struct {
  uint16_T Sum3;                       /* '<S211>/Sum3' */
  uint16_T Sum7;                       /* '<S211>/Sum7' */
} rtB_PositionNoReset_mcb_pmsm_fo;

/* Block signals for system '<S429>/If Action Subsystem' */
typedef struct {
  uint16_T Memory;                     /* '<S434>/Memory' */
  uint16_T Sum;                        /* '<S434>/Sum' */
  uint16_T Memory1;                    /* '<S434>/Memory1' */
  uint16_T Sum1;                       /* '<S434>/Sum1' */
} rtB_IfActionSubsystem_mcb_pm_hu;

/* Block states (default storage) for system '<S429>/If Action Subsystem' */
typedef struct {
  uint16_T Memory_PreviousInput;       /* '<S434>/Memory' */
  uint16_T Memory1_PreviousInput;      /* '<S434>/Memory1' */
} rtDW_IfActionSubsystem_mcb_pm_a;

/* Block signals for system '<S426>/SPI Master Transfer' */
typedef struct {
  uint16_T SPIMasterTransfer;          /* '<S426>/SPI Master Transfer' */
} rtB_SPIMasterTransfer_mcb_pmsm_;

