tefilus/DATN_backup/SIMULINK/mcb_pmsm_foc_qep_dyno_f28069m_ert_rtw/mcb_pmsm_foc_qep_dyno_f28069m.h
/* Block states (default storage) for system '<S426>/SPI Master Transfer' */
typedef struct {
  codertarget_tic2000_blocks_SPIM obj; /* '<S426>/SPI Master Transfer' */
  boolean_T objisempty;                /* '<S426>/SPI Master Transfer' */
} rtDW_SPIMasterTransfer_mcb_pmsm;

/* Block signals for system '<S426>/SPI Master Transfer2' */
typedef struct {
  uint16_T SPIMasterTransfer2;         /* '<S426>/SPI Master Transfer2' */
} rtB_SPIMasterTransfer2_mcb_pmsm;

/* Block states (default storage) for system '<S426>/SPI Master Transfer2' */
typedef struct {
  codertarget_tic2000_blocks_SPIM obj; /* '<S426>/SPI Master Transfer2' */
  boolean_T objisempty;                /* '<S426>/SPI Master Transfer2' */
} rtDW_SPIMasterTransfer2_mcb_pms;

/* Block signals for system '<Root>/Speed Limit for motor2' */
typedef struct {
  real32_T Product[2];                 /* '<S568>/Product' */
  real32_T UnitDelay[2];               /* '<S568>/Unit Delay' */
  real32_T Product1[2];                /* '<S568>/Product1' */
  real32_T Add1[2];                    /* '<S568>/Add1' */
} rtB_SpeedLimitformotor2_mcb_pms;

/* Block states (default storage) for system '<Root>/Speed Limit for motor2' */
typedef struct {
  real32_T UnitDelay_DSTATE[2];        /* '<S568>/Unit Delay' */
} rtDW_SpeedLimitformotor2_mcb_pm;

/* Block signals (default storage) */
typedef struct {
  real_T DiscreteTimeIntegrator;       /* '<S447>/Discrete-Time Integrator' */
  real_T Gain;                         /* '<S6>/Gain' */
  real_T DiscreteTimeIntegrator3;      /* '<S464>/Discrete-Time Integrator3' */
  real_T UnitDelay;                    /* '<S450>/Unit Delay' */
  real_T Switch1;                      /* '<S450>/Switch1' */
  real_T Gain4;                        /* '<S447>/Gain4' */
  real_T sine_cosine_o1;               /* '<S449>/sine_cosine' */
  real_T sine_cosine_o2;               /* '<S449>/sine_cosine' */
  real_T Product2;                     /* '<S459>/Product2' */
  real_T DiscreteTimeIntegrator3_c;    /* '<S465>/Discrete-Time Integrator3' */
  real_T Product3;                     /* '<S459>/Product3' */
  real_T Add1;                         /* '<S459>/Add1' */
  real_T DiscreteTimeIntegrator3_p;    /* '<S492>/Discrete-Time Integrator3' */
  real_T DiscreteTimeIntegrator3_k;    /* '<S493>/Discrete-Time Integrator3' */
  real_T Switch2;                      /* '<S6>/Switch2' */
  real_T Product;                      /* '<S460>/Product' */
  real_T Product_j;                    /* '<S463>/Product' */
  real_T Gain1;                        /* '<S460>/Gain1' */
  real_T Add;                          /* '<S460>/Add' */
  real_T Gain2;                        /* '<S460>/Gain2' */
  real_T Divide2;                      /* '<S447>/Divide2' */
  real_T Sign;                         /* '<S447>/Sign' */
  real_T Divide1;                      /* '<S447>/Divide1' */
  real_T Sum1;                         /* '<S447>/Sum1' */
  real_T Divide;                       /* '<S447>/Divide' */
  real_T Gain_n;                       /* '<S447>/Gain' */
  real_T Gain1_b;                      /* '<S450>/Gain1' */
  real_T Add_o;                        /* '<S450>/Add' */
  real_T Gain_j;                       /* '<S457>/Gain' */
  real_T Gain1_l;                      /* '<S457>/Gain1' */
  real_T Gain4_h;                      /* '<S457>/Gain4' */
  real_T Add_a;                        /* '<S457>/Add' */
  real_T Gain2_f;                      /* '<S457>/Gain2' */
  real_T Gain3;                        /* '<S457>/Gain3' */
  real_T Add1_e;                       /* '<S457>/Add1' */
  real_T Gain1_c;                      /* '<S458>/Gain1' */
  real_T Gain2_m;                      /* '<S458>/Gain2' */
  real_T Product_f;                    /* '<S459>/Product' */
  real_T Product1;                     /* '<S459>/Product1' */
  real_T Add_e;                        /* '<S459>/Add' */
  real_T Gain3_o;                      /* '<S458>/Gain3' */
  real_T Gain4_n;                      /* '<S458>/Gain4' */
  real_T Product2_h;                   /* '<S462>/Product2' */
  real_T Product3_h;                   /* '<S462>/Product3' */
  real_T Add1_p;                       /* '<S462>/Add1' */
  real_T Product_h;                    /* '<S466>/Product' */
  real_T Product_l;                    /* '<S464>/Product' */
  real_T Product_hs;                   /* '<S467>/Product' */
  real_T Product_m;                    /* '<S468>/Product' */
  real_T Add_b;                        /* '<S464>/Add' */
  real_T Product_e;                    /* '<S462>/Product' */
  real_T Product1_o;                   /* '<S462>/Product1' */
  real_T Add_i;                        /* '<S462>/Add' */
  real_T Product_hv;                   /* '<S469>/Product' */
  real_T Product_n;                    /* '<S465>/Product' */
  real_T Product_d;                    /* '<S470>/Product' */
  real_T Product_jr;                   /* '<S471>/Product' */
  real_T Product_g;                    /* '<S472>/Product' */
  real_T Add_l;                        /* '<S465>/Add' */
  real_T VectorConcatenate[3];         /* '<S446>/Vector Concatenate' */
  real_T UnitDelay_b;                  /* '<S478>/Unit Delay' */
  real_T Switch1_f;                    /* '<S478>/Switch1' */
  real_T Gain4_c;                      /* '<S475>/Gain4' */
  real_T sine_cosine_o1_o;             /* '<S477>/sine_cosine' */
  real_T sine_cosine_o2_d;             /* '<S477>/sine_cosine' */
  real_T Product2_o;                   /* '<S487>/Product2' */
  real_T Product3_o;                   /* '<S487>/Product3' */
  real_T Add1_c;                       /* '<S487>/Add1' */
  real_T Gain_p;                       /* '<S475>/Gain' */
  real_T Gain1_ct;                     /* '<S478>/Gain1' */
  real_T Add_p;                        /* '<S478>/Add' */
  real_T Switch1_f4[3];                /* '<S6>/Switch1' */
  real_T Gain_p4;                      /* '<S485>/Gain' */
  real_T Gain1_f;                      /* '<S485>/Gain1' */
  real_T Gain4_e;                      /* '<S485>/Gain4' */
  real_T Add_c;                        /* '<S485>/Add' */
  real_T Gain2_b;                      /* '<S485>/Gain2' */
  real_T Gain3_a;                      /* '<S485>/Gain3' */
  real_T Add1_b;                       /* '<S485>/Add1' */
  real_T Gain1_i;                      /* '<S486>/Gain1' */
  real_T Gain2_n;                      /* '<S486>/Gain2' */
  real_T Product_c;                    /* '<S487>/Product' */
  real_T Product1_a;                   /* '<S487>/Product1' */
  real_T Add_f;                        /* '<S487>/Add' */
  real_T Gain3_e;                      /* '<S486>/Gain3' */
  real_T Gain4_f;                      /* '<S486>/Gain4' */
  real_T Product2_hz;                  /* '<S490>/Product2' */
  real_T Product3_d;                   /* '<S490>/Product3' */
  real_T Add1_pe;                      /* '<S490>/Add1' */
  real_T Product_nq;                   /* '<S494>/Product' */
  real_T Product_ee;                   /* '<S492>/Product' */
  real_T Product_b;                    /* '<S495>/Product' */
  real_T Product_a;                    /* '<S496>/Product' */
  real_T Add_ob;                       /* '<S492>/Add' */
  real_T Product_o;                    /* '<S490>/Product' */
  real_T Product1_f;                   /* '<S490>/Product1' */
  real_T Add_j;                        /* '<S490>/Add' */
  real_T Product_jy;                   /* '<S497>/Product' */
  real_T Product_cr;                   /* '<S493>/Product' */
  real_T Product_p;                    /* '<S498>/Product' */
  real_T Product_ef;                   /* '<S499>/Product' */
  real_T Product_m2;                   /* '<S500>/Product' */
  real_T Add_bg;                       /* '<S493>/Add' */
  real_T VectorConcatenate_p[3];       /* '<S474>/Vector Concatenate' */
  real_T Gain1_m;                      /* '<S488>/Gain1' */
  real_T Product_d1;                   /* '<S488>/Product' */
  real_T Product_fu;                   /* '<S491>/Product' */
  real_T Add_n;                        /* '<S488>/Add' */
  real_T Gain2_l;                      /* '<S488>/Gain2' */
  real_T Add1_f;                       /* '<S478>/Add1' */
  real_T Switch;                       /* '<S478>/Switch' */
  real_T Subtract;                     /* '<S478>/Subtract' */
  real_T Add1_k;                       /* '<S450>/Add1' */
  real_T Switch_b;                     /* '<S450>/Switch' */
  real_T Subtract_b;                   /* '<S450>/Subtract' */
  uint32_T PositionToCount;            /* '<S395>/PositionToCount' */
  uint32_T Delay;                      /* '<S395>/Delay' */
  uint32_T Sum[4];                     /* '<S245>/Sum' */
  uint32_T PositionToCount_g;          /* '<S196>/PositionToCount' */
  uint32_T Delay_h;                    /* '<S196>/Delay' */
  uint32_T Sum_n[4];                   /* '<S178>/Sum' */
  uint32_T Sum_d[4];                   /* '<S34>/Sum' */
  real32_T RT1;                        /* '<Root>/RT1' */
  real32_T RT3;                        /* '<Root>/RT3' */
  real32_T RT9;                        /* '<Root>/RT9' */
  real32_T RT2[2];                     /* '<Root>/RT2' */
  real32_T mtr2_VI_debug[6];           /* '<Root>/RT8' */
  real32_T mtr2_Te_PU;                 /* '<Root>/RT8' */
  real32_T mtr2_Pm_PU;                 /* '<Root>/RT8' */
  real32_T mtr2_Speed_PU;              /* '<Root>/RT8' */
  real32_T mtr2_Iab_meas_PU[2];        /* '<Root>/RT8' */
  real32_T mtr2_Pos_PU;                /* '<Root>/RT8' */
  real32_T RT7[2];                     /* '<Root>/RT7' */
  real32_T Id_ref;                     /* '<S8>/Id_ref' */
  real32_T Switch_bo;                  /* '<S509>/Switch' */
  real32_T Product_dy;                 /* '<S564>/Product' */
  real32_T UnitDelay_g;                /* '<S564>/Unit Delay' */
  real32_T Product1_k;                 /* '<S564>/Product1' */
  real32_T Add1_cl;                    /* '<S564>/Add1' */
  real32_T Sum_k;                      /* '<S508>/Sum' */
  real32_T PProdOut;                   /* '<S549>/PProd Out' */
  real32_T Ki2;                        /* '<S508>/Ki2' */
  real32_T Integrator;                 /* '<S544>/Integrator' */
  real32_T Sum_l;                      /* '<S553>/Sum' */
  real32_T DeadZone;                   /* '<S537>/DeadZone' */
  real32_T IProdOut;                   /* '<S541>/IProd Out' */
  real32_T Switch_k;                   /* '<S535>/Switch' */
  real32_T Saturation;                 /* '<S551>/Saturation' */
  real32_T DataTypeConversion1;        /* '<S503>/Data Type Conversion1' */
  real32_T DataStoreRead2;             /* '<S7>/Data Store Read2' */
  real32_T DataStoreRead1;             /* '<S7>/Data Store Read1' */
  real32_T DataTypeConversion1_d[2];   /* '<S390>/Data Type Conversion1' */
  real32_T InvertingNoninvertingCurrentmea[2];
       /* '<S390>/Inverting // Non-inverting  Current measurement  amplifier' */
  real32_T DTC;                        /* '<S413>/DTC' */
  real32_T Product_mt;                 /* '<S394>/Product' */
  real32_T Switch_j;                   /* '<S402>/Switch' */
  real32_T Merge;                      /* '<S403>/Merge' */
  real32_T Numberofpolepairs;          /* '<S408>/Number of pole pairs' */
  real32_T Floor;                      /* '<S404>/Floor' */
  real32_T Add_c4;                     /* '<S404>/Add' */
  real32_T mtr2_VI_debug_k[6];
                   /* '<S3>/BusConversion_InsertedFor_mtr2_debug_at_inport_0' */
  real32_T DTC_n;                      /* '<S418>/DTC' */
  real32_T SpeedGain;                  /* '<S395>/SpeedGain' */
  real32_T Product_i;                  /* '<S398>/Product' */
  real32_T UnitDelay_f;                /* '<S398>/Unit Delay' */
  real32_T Product1_i;                 /* '<S398>/Product1' */
  real32_T Add1_i;                     /* '<S398>/Add1' */
  real32_T DataTypeConversion;         /* '<S237>/Data Type Conversion' */
  real32_T id_Ld_Lq;                   /* '<S420>/Product1' */
  real32_T Add_m;                      /* '<S420>/Add' */
  real32_T Product3_b;                 /* '<S420>/Product3' */
  real32_T u_5_Pp;                     /* '<S420>/1_5_Pp' */
  real32_T Product_hl;                 /* '<S420>/Product' */
  real32_T P_output;                   /* '<S420>/P_si2pu' */
  real32_T T_output;                   /* '<S420>/T_si2pu' */
  real32_T Switch_f[3];                /* '<S232>/Switch' */
  real32_T One_by_Two[3];              /* '<S237>/One_by_Two' */
  real32_T Mtr2_PWM_Duty_Cycles[3];    /* '<S237>/Sum' */
  real32_T UnitDelay_i;                /* '<S386>/Unit Delay' */
  real32_T Add_f4;                     /* '<S386>/Add' */
  real32_T Merge_l;                    /* '<S373>/Merge' */
  real32_T indexing;                   /* '<S245>/indexing' */
  real32_T Lookup[4];                  /* '<S245>/Lookup' */
  real32_T Sum3;                       /* '<S372>/Sum3' */
  real32_T DataTypeConversion1_j;      /* '<S245>/Data Type Conversion1' */
  real32_T Sum2;                       /* '<S245>/Sum2' */
  real32_T Product_k;                  /* '<S372>/Product' */
  real32_T Sum4;                       /* '<S372>/Sum4' */
  real32_T Sum5;                       /* '<S372>/Sum5' */
  real32_T Product1_c;                 /* '<S372>/Product1' */
  real32_T Sum6;                       /* '<S372>/Sum6' */
  real32_T Id_fb;
  real32_T Sum_g;                      /* '<S251>/Sum' */
  real32_T PProdOut_i;                 /* '<S356>/PProd Out' */
  real32_T Kp1;                        /* '<S251>/Kp1' */
  real32_T Integrator_i;               /* '<S351>/Integrator' */
  real32_T Sum_e;                      /* '<S360>/Sum' */
  real32_T Saturation_g;               /* '<S358>/Saturation' */
  real32_T Sum_b;                      /* '<S250>/Sum' */
  real32_T PProdOut_f;                 /* '<S305>/PProd Out' */
  real32_T Ki1;                        /* '<S250>/Ki1' */
  real32_T Integrator_p;               /* '<S300>/Integrator' */
  real32_T Sum_eg;                     /* '<S309>/Sum' */
  real32_T Saturation_l;               /* '<S307>/Saturation' */
  real32_T Switch_c;                   /* '<S254>/Switch' */
  real32_T Product_efr;                /* '<S254>/Product' */
  real32_T Product_mp;                 /* '<S255>/Product' */
  real32_T Product1_p;                 /* '<S255>/Product1' */
  real32_T Sum1_h;                     /* '<S255>/Sum1' */
  real32_T Merge_o[2];                 /* '<S249>/Merge' */
  real32_T Vd_ref;
  real32_T Iq_fb;
  real32_T Vq_ref;
  real32_T Id_Ref;/* '<S239>/BusConversion_InsertedFor_Idq_debug_at_inport_0' */
  real32_T Iq_Ref;/* '<S239>/BusConversion_InsertedFor_Idq_debug_at_inport_0' */
  real32_T DeadZone_a;                 /* '<S293>/DeadZone' */
  real32_T IProdOut_g;                 /* '<S297>/IProd Out' */
  real32_T Switch_p;                   /* '<S291>/Switch' */
  real32_T DeadZone_p;                 /* '<S344>/DeadZone' */
  real32_T IProdOut_j;                 /* '<S348>/IProd Out' */
  real32_T Switch_ca;                  /* '<S342>/Switch' */
  real32_T one_by_two;                 /* '<S383>/one_by_two' */
  real32_T sqrt3_by_two;               /* '<S383>/sqrt3_by_two' */
  real32_T add_b;                      /* '<S383>/add_b' */
  real32_T add_c;                      /* '<S383>/add_c' */
  real32_T Max;                        /* '<S380>/Max' */
  real32_T Min;                        /* '<S380>/Min' */
  real32_T Add_jf;                     /* '<S380>/Add' */
  real32_T one_by_two_f;               /* '<S380>/one_by_two' */
  real32_T Add1_fj;                    /* '<S379>/Add1' */
  real32_T Add2;                       /* '<S379>/Add2' */
  real32_T Add3;                       /* '<S379>/Add3' */
  real32_T Gain_nu[3];                 /* '<S379>/Gain' */
  real32_T DataTypeConversion1_g[2];   /* '<S191>/Data Type Conversion1' */
  real32_T DTC_c;                      /* '<S214>/DTC' */
  real32_T Product_hsp;                /* '<S195>/Product' */
  real32_T Switch_ce;                  /* '<S203>/Switch' */
  real32_T Merge_c;                    /* '<S204>/Merge' */
  real32_T Numberofpolepairs_d;        /* '<S209>/Number of pole pairs' */
  real32_T Floor_p;                    /* '<S205>/Floor' */
  real32_T Add_k;                      /* '<S205>/Add' */
  real32_T id_Ld_Lq_o;                 /* '<S221>/Product1' */
  real32_T Add_mq;                     /* '<S221>/Add' */
  real32_T Product3_bq;                /* '<S221>/Product3' */
  real32_T u_5_Pp_i;                   /* '<S221>/1_5_Pp' */
  real32_T DTC_nv;                     /* '<S219>/DTC' */
  real32_T SpeedGain_n;                /* '<S196>/SpeedGain' */
  real32_T Product_li;                 /* '<S199>/Product' */
  real32_T UnitDelay_o;                /* '<S199>/Unit Delay' */
  real32_T Product1_b;                 /* '<S199>/Product1' */
  real32_T Add1_kb;                    /* '<S199>/Add1' */
  real32_T Product_la;                 /* '<S221>/Product' */
  real32_T P_output_g;                 /* '<S221>/P_si2pu' */
  real32_T mtr1_speed_ref_PU;          /* '<S26>/Data Store Read' */
  real32_T TmpSignalConversionAtSelectorIn[25];
  real32_T Selector[2];                /* '<S26>/Selector' */
  real32_T DataTypeConversion_e;       /* '<S23>/Data Type Conversion' */
  real32_T Switch_i[3];                /* '<S19>/Switch' */
  real32_T One_by_Two_e[3];            /* '<S23>/One_by_Two' */
  real32_T Mtr1_PWM_Duty_Cycles[3];    /* '<S23>/Sum' */
  real32_T rpm2freq;                   /* '<S28>/rpm2freq' */
  real32_T Eps;                        /* '<S175>/Ramp Generator' */
  real32_T Product_mc;                 /* '<S28>/Product' */
  real32_T Frequency;                  /* '<S28>/Abs' */
  real32_T Vbyf;                       /* '<S28>/V-by-f' */
  real32_T Correction_Factor_sinePWM;  /* '<S28>/Correction_Factor_sinePWM' */
  real32_T Amplitude;                  /* '<S28>/Saturation' */
  real32_T UnaryMinus;                 /* '<S173>/Unary Minus' */
  real32_T position_increment;         /* '<S28>/position_increment' */
  real32_T scaleIn;                    /* '<S174>/scaleIn' */
  real32_T UnitDelay_h;                /* '<S174>/Unit Delay' */
  real32_T scaleOut;                   /* '<S174>/scaleOut' */
  real32_T DataStoreRead;              /* '<S28>/Data Store Read' */
  real32_T Eps_i;                      /* '<S28>/Direction' */
  real32_T convert_pu;                 /* '<S183>/convert_pu' */
  real32_T Merge_d;                    /* '<S183>/Merge' */
  real32_T indexing_m;                 /* '<S178>/indexing' */
  real32_T Lookup_l[4];                /* '<S178>/Lookup' */
  real32_T Sum3_p;                     /* '<S182>/Sum3' */
  real32_T DataTypeConversion1_c;      /* '<S178>/Data Type Conversion1' */
  real32_T Sum2_c;                     /* '<S178>/Sum2' */
  real32_T Product_je;                 /* '<S182>/Product' */
  real32_T Sum4_m;                     /* '<S182>/Sum4' */
  real32_T Sum5_p;                     /* '<S182>/Sum5' */
  real32_T Product1_j;                 /* '<S182>/Product1' */
  real32_T Sum6_p;                     /* '<S182>/Sum6' */
  real32_T Ka;                         /* '<S179>/Ka' */
  real32_T one_by_two_m;               /* '<S179>/one_by_two' */
  real32_T sqrt3_by_two_g;             /* '<S179>/sqrt3_by_two' */
  real32_T add_b_c;                    /* '<S179>/add_b' */
  real32_T Kb;                         /* '<S179>/Kb' */
  real32_T add_c_i;                    /* '<S179>/add_c' */
  real32_T Kc;                         /* '<S179>/Kc' */
  real32_T Divide_h;                   /* '<S175>/Divide' */
  real32_T Sample_Time;                /* '<S175>/Sample_Time' */
  real32_T Sum_k3;                     /* '<S28>/Sum' */
  real32_T Add_oe;                     /* '<S187>/Add' */
  real32_T DataTypeConversion1_k;      /* '<S187>/Data Type Conversion1' */
  real32_T Add1_j;                     /* '<S187>/Add1' */
  real32_T Input;                      /* '<S188>/Input' */
  real32_T Merge_g;                    /* '<S162>/Merge' */
  real32_T indexing_j;                 /* '<S34>/indexing' */
  real32_T Lookup_c[4];                /* '<S34>/Lookup' */
  real32_T Sum3_a;                     /* '<S161>/Sum3' */
  real32_T DataTypeConversion1_cg;     /* '<S34>/Data Type Conversion1' */
  real32_T Sum2_f;                     /* '<S34>/Sum2' */
  real32_T Product_dl;                 /* '<S161>/Product' */
  real32_T Sum4_e;                     /* '<S161>/Sum4' */
  real32_T Sum5_d;                     /* '<S161>/Sum5' */
  real32_T Product1_bt;                /* '<S161>/Product1' */
  real32_T Sum6_o;                     /* '<S161>/Sum6' */
  real32_T Id_fb_f;
  real32_T Sum_c;                      /* '<S40>/Sum' */
  real32_T PProdOut_c;                 /* '<S145>/PProd Out' */
  real32_T Kp1_m;                      /* '<S40>/Kp1' */
  real32_T Integrator_f;               /* '<S140>/Integrator' */
  real32_T Sum_dd;                     /* '<S149>/Sum' */
  real32_T Saturation_a;               /* '<S147>/Saturation' */
  real32_T Sum_o;                      /* '<S39>/Sum' */
  real32_T PProdOut_iz;                /* '<S94>/PProd Out' */
  real32_T Ki1_a;                      /* '<S39>/Ki1' */
  real32_T Integrator_m;               /* '<S89>/Integrator' */
  real32_T Sum_nt;                     /* '<S98>/Sum' */
  real32_T Saturation_f;               /* '<S96>/Saturation' */
  real32_T Switch_m;                   /* '<S43>/Switch' */
  real32_T Product_ng;                 /* '<S43>/Product' */
  real32_T Product_hg;                 /* '<S44>/Product' */
  real32_T Product1_d;                 /* '<S44>/Product1' */
  real32_T Sum1_c;                     /* '<S44>/Sum1' */
  real32_T Merge_g1[2];                /* '<S38>/Merge' */
  real32_T Vd_ref_i;
  real32_T Iq_fb_j;
  real32_T Vq_ref_n;
  real32_T Id_Ref_j;
                   /* '<S27>/BusConversion_InsertedFor_Idq_debug_at_inport_0' */
  real32_T Iq_Ref_a;
                   /* '<S27>/BusConversion_InsertedFor_Idq_debug_at_inport_0' */
  real32_T DeadZone_d;                 /* '<S82>/DeadZone' */
  real32_T IProdOut_e;                 /* '<S86>/IProd Out' */
  real32_T Switch_h;                   /* '<S80>/Switch' */
  real32_T DeadZone_n;                 /* '<S133>/DeadZone' */
  real32_T IProdOut_o;                 /* '<S137>/IProd Out' */
  real32_T Switch_g;                   /* '<S131>/Switch' */
  real32_T one_by_two_k;               /* '<S172>/one_by_two' */
  real32_T sqrt3_by_two_e;             /* '<S172>/sqrt3_by_two' */
  real32_T add_b_ch;                   /* '<S172>/add_b' */
  real32_T add_c_e;                    /* '<S172>/add_c' */
  real32_T Max_o;                      /* '<S169>/Max' */
  real32_T Min_k;                      /* '<S169>/Min' */
  real32_T Add_fm;                     /* '<S169>/Add' */
  real32_T one_by_two_i;               /* '<S169>/one_by_two' */
  real32_T Add1_b3;                    /* '<S168>/Add1' */
  real32_T Add2_a;                     /* '<S168>/Add2' */
  real32_T Add3_e;                     /* '<S168>/Add3' */
  real32_T Gain_jt[3];                 /* '<S168>/Gain' */
  int32_T DataTypeConversion_h[2];     /* '<S390>/Data Type Conversion' */
  int32_T Add_cm[2];                   /* '<S390>/Add' */
  int32_T Q17perunitconversion[2];     /* '<S390>/Q17 per unit conversion' */
  int32_T SpeedCount;                  /* '<S395>/SpeedCount' */
  int32_T DataTypeConversion_f[2];     /* '<S191>/Data Type Conversion' */
  int32_T Add_as[2];                   /* '<S191>/Add' */
  int32_T Q17perunitconversion_h[2];   /* '<S191>/Q17 per unit conversion' */
  int32_T SpeedCount_e;                /* '<S196>/SpeedCount' */
  uint16_T Divide2_c;                  /* '<S435>/Divide2' */
  uint16_T Divide3;                    /* '<S435>/Divide3' */
  uint16_T ForIterator;                /* '<S437>/For Iterator' */
  uint16_T IAIBMeasurement[2];         /* '<S437>/IA//IB Measurement' */
  uint16_T Divide_f;                   /* '<S427>/Divide' */
