tefilus/DATN_backup/SIMULINK/mcb_pmsm_foc_qep_dyno_f28069m_ert_rtw/mcb_pmsm_foc_qep_dyno_f28069m.h
  uint16_T Divide1_m;                  /* '<S427>/Divide1' */
  uint16_T ForIterator_a;              /* '<S429>/For Iterator' */
  uint16_T IAIBMeasurement_e[2];       /* '<S429>/IA//IB Measurement' */
  uint16_T SCIReceive[2];              /* '<S501>/SCI Receive' */
  uint16_T BitwiseOperator;            /* '<S507>/Bitwise Operator' */
  uint16_T BitwiseOperator1;           /* '<S507>/Bitwise Operator1' */
  uint16_T ShiftArithmetic1;           /* '<S507>/Shift Arithmetic1' */
  uint16_T BitwiseOperator2;           /* '<S507>/Bitwise Operator2' */
  uint16_T ShiftArithmetic;            /* '<S507>/Shift Arithmetic' */
  uint16_T DataStoreRead_j;            /* '<S390>/Data Store Read' */
  uint16_T DataStoreRead1_i;           /* '<S390>/Data Store Read1' */
  uint16_T IAIBMeasurement_f[2];       /* '<S388>/IA//IB Measurement' */
  uint16_T eQEP_o1;                    /* '<S388>/eQEP' */
  uint16_T eQEP_o2;                    /* '<S388>/eQEP' */
  uint16_T Merge_de;                   /* '<S394>/Merge' */
  uint16_T Switch1_g[3];               /* '<S236>/Switch1' */
  uint16_T Scale_to_PWM_Counter_PRD[3];/* '<S236>/Scale_to_PWM_Counter_PRD' */
  uint16_T DataTypeConversion_ec;      /* '<S373>/Data Type Conversion' */
  uint16_T Get_Integer;                /* '<S245>/Get_Integer' */
  uint16_T Switch1_d;                  /* '<S254>/Switch1' */
  uint16_T eQEP_o1_e;                  /* '<S189>/eQEP' */
  uint16_T eQEP_o2_b;                  /* '<S189>/eQEP' */
  uint16_T DataStoreRead_k;            /* '<S191>/Data Store Read' */
  uint16_T DataStoreRead1_c;           /* '<S191>/Data Store Read1' */
  uint16_T IAIBMeasurement_c[2];       /* '<S189>/IA//IB Measurement' */
  uint16_T Merge_n;                    /* '<S195>/Merge' */
  uint16_T Output;                     /* '<S225>/Output' */
  uint16_T DataStoreRead1_l;           /* '<S26>/Data Store Read1' */
  uint16_T MultiportSwitch[2];         /* '<S26>/Multiport Switch' */
  uint16_T DataTypeConversion3[2];     /* '<S227>/Data Type Conversion3' */
  uint16_T SCI_Tx_Data[3];             /* '<S223>/Merge' */
  uint16_T SCI_Tx_Iteration;           /* '<S223>/Merge1' */
  uint16_T FixPtSum1;                  /* '<S230>/FixPt Sum1' */
  uint16_T FixPtSwitch;                /* '<S231>/FixPt Switch' */
  uint16_T Switch1_gd[3];              /* '<S22>/Switch1' */
  uint16_T IndexVector;                /* '<S224>/Index Vector' */
  uint16_T Add_m4;                     /* '<S224>/Add' */
  uint16_T Data[2];                    /* '<S226>/Data' */
  uint16_T Data_f[2];                  /* '<S228>/Data' */
  uint16_T Data_fw[2];                 /* '<S229>/Data' */
  uint16_T Scale_to_PWM_Counter_PRD_e[3];/* '<S22>/Scale_to_PWM_Counter_PRD' */
  uint16_T DataTypeConversion_p;       /* '<S183>/Data Type Conversion' */
  uint16_T Get_Integer_e;              /* '<S178>/Get_Integer' */
  uint16_T DataTypeConversion_hf;      /* '<S162>/Data Type Conversion' */
  uint16_T Get_Integer_g;              /* '<S34>/Get_Integer' */
  uint16_T Switch1_f0;                 /* '<S43>/Switch1' */
  int16_T DataTypeConversion2;         /* '<S503>/Data Type Conversion2' */
  int16_T DataTypeConversion_p3[2];    /* '<S227>/Data Type Conversion' */
  int16_T WhileIterator;               /* '<S224>/While Iterator' */
  int16_T DataTypeConversion_c;        /* '<S187>/Data Type Conversion' */
  int16_T Switch1_n;                   /* '<S535>/Switch1' */
  int16_T Switch2_l;                   /* '<S535>/Switch2' */
  int16_T Switch1_l;                   /* '<S291>/Switch1' */
  int16_T Switch2_e;                   /* '<S291>/Switch2' */
  int16_T Switch1_fn;                  /* '<S342>/Switch1' */
  int16_T Switch2_lu;                  /* '<S342>/Switch2' */
  int16_T Switch1_p;                   /* '<S80>/Switch1' */
  int16_T Switch2_g;                   /* '<S80>/Switch2' */
  int16_T Switch1_dk;                  /* '<S131>/Switch1' */
  int16_T Switch2_a;                   /* '<S131>/Switch2' */
  boolean_T DataStoreRead1_a;          /* '<S6>/Data Store Read1' */
  boolean_T DataStoreRead2_n;          /* '<S6>/Data Store Read2' */
  boolean_T Compare;                   /* '<S452>/Compare' */
  boolean_T Compare_f;                 /* '<S480>/Compare' */
  boolean_T DataStoreRead1_k;          /* '<S508>/Data Store Read1' */
  boolean_T DataStoreRead2_l;          /* '<S508>/Data Store Read2' */
  boolean_T AND;                       /* '<S508>/AND' */
  boolean_T DataStoreRead_f;           /* '<S509>/Data Store Read' */
  boolean_T LogicalOperator;           /* '<S508>/Logical Operator' */
  boolean_T RelationalOperator;        /* '<S535>/Relational Operator' */
  boolean_T fixforDTpropagationissue;/* '<S535>/fix for DT propagation issue' */
  boolean_T fixforDTpropagationissue1;
                                    /* '<S535>/fix for DT propagation issue1' */
  boolean_T Equal1;                    /* '<S535>/Equal1' */
  boolean_T AND3;                      /* '<S535>/AND3' */
  boolean_T Compare_c;                 /* '<S479>/Compare' */
  boolean_T Compare_e;                 /* '<S451>/Compare' */
  boolean_T NOT;                       /* '<S425>/NOT' */
  boolean_T NOT_d;                     /* '<S424>/NOT' */
  boolean_T DataTypeConversion3_o;     /* '<S507>/Data Type Conversion3' */
  boolean_T DataStoreRead1_cg;         /* '<S3>/Data Store Read1' */
  boolean_T Delay_m;                   /* '<S389>/Delay' */
  boolean_T NOT_e;                     /* '<S389>/NOT' */
  boolean_T PWM_En;                    /* '<S237>/Enable' */
  boolean_T DataStoreRead2_d;          /* '<S384>/Data Store Read2' */
  boolean_T DataStoreRead1_n;          /* '<S384>/Data Store Read1' */
  boolean_T AND_d;                     /* '<S384>/AND' */
  boolean_T NOT_c;                     /* '<S384>/NOT' */
  boolean_T Switch_pk;                 /* '<S386>/Switch' */
  boolean_T Compare_ee;                /* '<S374>/Compare' */
  boolean_T LogicalOperator_i;         /* '<S251>/Logical Operator' */
  boolean_T LogicalOperator_d;         /* '<S250>/Logical Operator' */
  boolean_T RelationalOperator_a;      /* '<S291>/Relational Operator' */
  boolean_T fixforDTpropagationissue_g;
                                     /* '<S291>/fix for DT propagation issue' */
  boolean_T fixforDTpropagationissue1_c;
                                    /* '<S291>/fix for DT propagation issue1' */
  boolean_T Equal1_p;                  /* '<S291>/Equal1' */
  boolean_T AND3_o;                    /* '<S291>/AND3' */
  boolean_T RelationalOperator_l;      /* '<S342>/Relational Operator' */
  boolean_T fixforDTpropagationissue_m;
                                     /* '<S342>/fix for DT propagation issue' */
  boolean_T fixforDTpropagationissue1_h;
                                    /* '<S342>/fix for DT propagation issue1' */
  boolean_T Equal1_a;                  /* '<S342>/Equal1' */
  boolean_T AND3_ob;                   /* '<S342>/AND3' */
  boolean_T Delay_mk;                  /* '<S190>/Delay' */
  boolean_T NOT_m;                     /* '<S190>/NOT' */
  boolean_T DataStoreRead_kj;          /* '<S19>/Data Store Read' */
  boolean_T NOT_dl;                    /* '<S19>/NOT' */
  boolean_T PWM_En_b;                  /* '<S23>/Enable' */
  boolean_T DataStoreRead1_n5;         /* '<S28>/Data Store Read1' */
  boolean_T NOT_p;                     /* '<S175>/NOT' */
  boolean_T NOT_j;                     /* '<S174>/NOT' */
  boolean_T Compare_k;                 /* '<S184>/Compare' */
  boolean_T Delay_n;                   /* '<S187>/Delay' */
  boolean_T Compare_eh;                /* '<S163>/Compare' */
  boolean_T LogicalOperator_h;         /* '<S40>/Logical Operator' */
  boolean_T LogicalOperator_e;         /* '<S39>/Logical Operator' */
  boolean_T RelationalOperator_c;      /* '<S80>/Relational Operator' */
  boolean_T fixforDTpropagationissue_k;
                                      /* '<S80>/fix for DT propagation issue' */
  boolean_T fixforDTpropagationissue1_d;
                                     /* '<S80>/fix for DT propagation issue1' */
  boolean_T Equal1_k;                  /* '<S80>/Equal1' */
  boolean_T AND3_j;                    /* '<S80>/AND3' */
  boolean_T RelationalOperator_g;      /* '<S131>/Relational Operator' */
  boolean_T fixforDTpropagationissue_mc;
                                     /* '<S131>/fix for DT propagation issue' */
  boolean_T fixforDTpropagationissue1_e;
                                    /* '<S131>/fix for DT propagation issue1' */
  boolean_T Equal1_h;                  /* '<S131>/Equal1' */
  boolean_T AND3_k;                    /* '<S131>/AND3' */
  rtB_SpeedLimitformotor2_mcb_pms SpeedLimitformotor2;/* '<Root>/Speed Limit for motor2' */
  rtB_SPIMasterTransfer2_mcb_pmsm SPIMasterTransfer3;/* '<S426>/SPI Master Transfer2' */
  rtB_SPIMasterTransfer2_mcb_pmsm SPIMasterTransfer2;/* '<S426>/SPI Master Transfer2' */
  rtB_SPIMasterTransfer_mcb_pmsm_ SPIMasterTransfer1;/* '<S426>/SPI Master Transfer' */
  rtB_SPIMasterTransfer_mcb_pmsm_ SPIMasterTransfer;/* '<S426>/SPI Master Transfer' */
  rtB_IfActionSubsystem_mcb_pm_hu IfActionSubsystem1_i;/* '<S437>/If Action Subsystem1' */
  rtB_IfActionSubsystem_mcb_pm_hu IfActionSubsystem_g;/* '<S429>/If Action Subsystem' */
  rtB_PositionNoReset_mcb_pmsm_fo PositionNoReset_i;/* '<S394>/PositionNoReset' */
  rtB_IndexFinder_mcb_pmsm_foc_qe IndexFinder_b;/* '<S389>/IndexFinder' */
  rtB_IfActionSubsystem1_mcb_pmsm IfActionSubsystem1_d;/* '<S373>/If Action Subsystem1' */
  rtB_IfActionSubsystem_mcb_pmsm_ IfActionSubsystem_i;/* '<S373>/If Action Subsystem' */
  rtB_TwoinputsCRL_mcb_pmsm_foc_o TwoinputsCRL_i;/* '<S244>/Two inputs CRL' */
  rtB_TwoinputsCRL_mcb_pmsm_foc_q TwoinputsCRL_n;/* '<S243>/Two inputs CRL' */
  rtB_DQEquivalence_mcb_pmsm_foc_ DQEquivalence_j;/* '<S249>/D-Q Equivalence' */
  rtB_DQAxisPriority_mcb_pmsm_foc DQAxisPriority_d;/* '<S249>/D//Q Axis Priority' */
  rtB_TwophaseCRLwrap_mcb_pmsm_fo TwophaseCRLwrap_n;/* '<S247>/Two phase CRL wrap' */
  rtB_PositionNoReset_mcb_pmsm_fo PositionNoReset;/* '<S195>/PositionNoReset' */
  rtB_IndexFinder_mcb_pmsm_foc_qe IndexFinder;/* '<S190>/IndexFinder' */
  rtB_IfActionSubsystem1_mcb_pmsm IfActionSubsystem1_p;/* '<S183>/If Action Subsystem1' */
  rtB_IfActionSubsystem_mcb_pmsm_ IfActionSubsystem_j;/* '<S183>/If Action Subsystem' */
  rtB_TwoinputsCRL_mcb_pmsm_foc_q TwoinputsCRL_p;/* '<S177>/Two inputs CRL' */
  rtB_IfActionSubsystem1_mcb_pmsm IfActionSubsystem1_b;/* '<S162>/If Action Subsystem1' */
  rtB_IfActionSubsystem_mcb_pmsm_ IfActionSubsystem_b;/* '<S162>/If Action Subsystem' */
  rtB_TwoinputsCRL_mcb_pmsm_foc_o TwoinputsCRL_g;/* '<S33>/Two inputs CRL' */
  rtB_TwoinputsCRL_mcb_pmsm_foc_q TwoinputsCRL;/* '<S32>/Two inputs CRL' */
  rtB_DQEquivalence_mcb_pmsm_foc_ DQEquivalence;/* '<S38>/D-Q Equivalence' */
  rtB_DQAxisPriority_mcb_pmsm_foc DQAxisPriority;/* '<S38>/D//Q Axis Priority' */
  rtB_TwophaseCRLwrap_mcb_pmsm_fo TwophaseCRLwrap;/* '<S36>/Two phase CRL wrap' */
} BlockIO_mcb_pmsm_foc_qep_dyno_f;

