tefilus/DATN_backup/SIMULINK/mcb_pmsm_foc_qep_dyno_f28069m_ert_rtw/mcb_pmsm_foc_qep_dyno_f28069m.h
/* Block states (default storage) for system '<Root>' */
typedef struct {
  real_T DiscreteTimeIntegrator_DSTATE;/* '<S447>/Discrete-Time Integrator' */
  real_T DiscreteTimeIntegrator3_DSTATE;/* '<S464>/Discrete-Time Integrator3' */
  real_T UnitDelay_DSTATE;             /* '<S450>/Unit Delay' */
  real_T DiscreteTimeIntegrator3_DSTAT_b;/* '<S465>/Discrete-Time Integrator3' */
  real_T DiscreteTimeIntegrator3_DSTAT_m;/* '<S492>/Discrete-Time Integrator3' */
  real_T DiscreteTimeIntegrator3_DSTAT_j;/* '<S493>/Discrete-Time Integrator3' */
  real_T UnitDelay_DSTATE_h;           /* '<S478>/Unit Delay' */
  real_T Add1_DWORK1;                  /* '<S478>/Add1' */
  real32_T UnitDelay_DSTATE_a;         /* '<S564>/Unit Delay' */
  real32_T Integrator_DSTATE;          /* '<S544>/Integrator' */
  real32_T UnitDelay_DSTATE_d;         /* '<S398>/Unit Delay' */
  real32_T UnitDelay_DSTATE_a0;        /* '<S386>/Unit Delay' */
  real32_T Integrator_DSTATE_a;        /* '<S351>/Integrator' */
  real32_T Integrator_DSTATE_o;        /* '<S300>/Integrator' */
  real32_T UnitDelay_DSTATE_c;         /* '<S199>/Unit Delay' */
  real32_T RampGenerator_DSTATE;       /* '<S175>/Ramp Generator' */
  real32_T UnitDelay_DSTATE_p;         /* '<S174>/Unit Delay' */
  real32_T Integrator_DSTATE_c;        /* '<S140>/Integrator' */
  real32_T Integrator_DSTATE_g;        /* '<S89>/Integrator' */
  uint32_T Delay_DSTATE[20];           /* '<S395>/Delay' */
  uint32_T Delay_DSTATE_n[20];         /* '<S196>/Delay' */
  volatile real32_T RT1_Buffer[2];     /* '<Root>/RT1' */
  volatile real32_T RT3_Buffer[2];     /* '<Root>/RT3' */
  volatile real32_T RT2_Buffer[4];     /* '<Root>/RT2' */
  volatile real32_T RT9_Buffer[2];     /* '<Root>/RT9' */
  volatile real32_T RT7_Buffer[4];     /* '<Root>/RT7' */
  volatile real32_T RT8_1_Buffer[12];  /* '<Root>/RT8' */
  volatile real32_T RT8_2_Buffer[2];   /* '<Root>/RT8' */
  volatile real32_T RT8_3_Buffer[2];   /* '<Root>/RT8' */
  volatile real32_T RT8_4_Buffer[2];   /* '<Root>/RT8' */
  volatile real32_T RT8_5_Buffer[4];   /* '<Root>/RT8' */
  volatile real32_T RT8_6_Buffer[2];   /* '<Root>/RT8' */
  real32_T SpeedRef;                   /* '<Root>/Data Store Memory4' */
  real32_T IqRef;                      /* '<Root>/Data Store Memory6' */
  real32_T Add_DWORK1;                 /* '<S386>/Add' */
  int32_T LEDblink_FRAC_LEN;           /* '<S5>/LED blink' */
  int32_T DigitalOutput1_FRAC_LEN;     /* '<S426>/Digital Output1' */
  int32_T DigitalOutput2_FRAC_LEN;     /* '<S426>/Digital Output2' */
  int32_T Add_DWORK1_g[2];             /* '<S390>/Add' */
  int32_T SpeedCount_DWORK1;           /* '<S395>/SpeedCount' */
  int32_T DigitalOutput2_FRAC_LEN_i;   /* '<S236>/Digital Output2' */
  int32_T Add_DWORK1_m[2];             /* '<S191>/Add' */
  int32_T SpeedCount_DWORK1_l;         /* '<S196>/SpeedCount' */
  int32_T DigitalOutput1_FRAC_LEN_k;   /* '<S22>/Digital Output1' */
  uint32_T Sum_DWORK1[4];              /* '<S245>/Sum' */
  uint32_T Sum_DWORK1_e[4];            /* '<S178>/Sum' */
  uint16_T Output_DSTATE;              /* '<S225>/Output' */
  volatile int16_T RT1_ActiveBufIdx;   /* '<Root>/RT1' */
  volatile int16_T RT1_semaphoreTaken; /* '<Root>/RT1' */
  volatile int16_T RT3_ActiveBufIdx;   /* '<Root>/RT3' */
  volatile int16_T RT2_ActiveBufIdx;   /* '<Root>/RT2' */
  volatile int16_T RT9_ActiveBufIdx;   /* '<Root>/RT9' */
  volatile int16_T RT7_ActiveBufIdx;   /* '<Root>/RT7' */
  volatile int16_T RT8_1_ActiveBufIdx; /* '<Root>/RT8' */
  volatile int16_T RT8_2_ActiveBufIdx; /* '<Root>/RT8' */
  volatile int16_T RT8_3_ActiveBufIdx; /* '<Root>/RT8' */
  volatile int16_T RT8_4_ActiveBufIdx; /* '<Root>/RT8' */
  volatile int16_T RT8_5_ActiveBufIdx; /* '<Root>/RT8' */
  volatile int16_T RT8_6_ActiveBufIdx; /* '<Root>/RT8' */
  uint16_T IaOffset_motor1;            /* '<Root>/Data Store Memory1' */
  uint16_T IbOffset_motor1;            /* '<Root>/Data Store Memory2' */
  uint16_T Debug_signals;              /* '<Root>/Data Store Memory9' */
  uint16_T IbOffset_motor2;            /* '<Root>/Data Store Memory7' */
  uint16_T IaOffset_motor2;            /* '<Root>/Data Store Memory8' */
  uint16_T CircBufIdx;                 /* '<S395>/Delay' */
  uint16_T CircBufIdx_g;               /* '<S196>/Delay' */
  uint16_T Add_DWORK1_b;               /* '<S224>/Add' */
  boolean_T Delay_DSTATE_d;            /* '<S389>/Delay' */
  boolean_T Delay_DSTATE_o;            /* '<S190>/Delay' */
  boolean_T Delay_DSTATE_j;            /* '<S187>/Delay' */
  int16_T Integrator_PrevResetState;   /* '<S544>/Integrator' */
  int16_T Integrator_PrevResetState_p; /* '<S351>/Integrator' */
  int16_T Integrator_PrevResetState_i; /* '<S300>/Integrator' */
  int16_T Integrator_PrevResetState_pk;/* '<S140>/Integrator' */
  int16_T Integrator_PrevResetState_h; /* '<S89>/Integrator' */
  uint16_T DiscreteTimeIntegrator3_IC_LOAD;/* '<S464>/Discrete-Time Integrator3' */
  uint16_T DiscreteTimeIntegrator3_IC_LO_n;/* '<S465>/Discrete-Time Integrator3' */
  uint16_T DiscreteTimeIntegrator3_IC_LO_e;/* '<S492>/Discrete-Time Integrator3' */
  uint16_T DiscreteTimeIntegrator3_IC_LO_f;/* '<S493>/Discrete-Time Integrator3' */
  boolean_T EnMtr2TrqCtrl;             /* '<Root>/Data Store Memory5' */
  boolean_T Enable;                    /* '<Root>/Data Store Memory29' */
  boolean_T EnClosedLoop;              /* '<Root>/Data Store Memory3' */
  boolean_T EnableEnMtr2TrqCtrlafter2secdel;
                           /* '<S384>/Enable EnMtr2TrqCtrl after 2 sec delay' */
  boolean_T OpenLoopStartUp_MODE;      /* '<S19>/Open Loop Start-Up' */
  rtDW_SpeedLimitformotor2_mcb_pm SpeedLimitformotor2;/* '<Root>/Speed Limit for motor2' */
  rtDW_SPIMasterTransfer2_mcb_pms SPIMasterTransfer3;/* '<S426>/SPI Master Transfer2' */
  rtDW_SPIMasterTransfer2_mcb_pms SPIMasterTransfer2;/* '<S426>/SPI Master Transfer2' */
  rtDW_SPIMasterTransfer_mcb_pmsm SPIMasterTransfer1;/* '<S426>/SPI Master Transfer' */
  rtDW_SPIMasterTransfer_mcb_pmsm SPIMasterTransfer;/* '<S426>/SPI Master Transfer' */
  rtDW_IfActionSubsystem_mcb_pm_a IfActionSubsystem1_i;/* '<S437>/If Action Subsystem1' */
  rtDW_IfActionSubsystem_mcb_pm_a IfActionSubsystem_g;/* '<S429>/If Action Subsystem' */
  rtDW_IndexFinder_mcb_pmsm_foc_q IndexFinder_b;/* '<S389>/IndexFinder' */
  rtDW_IndexFinder_mcb_pmsm_foc_q IndexFinder;/* '<S190>/IndexFinder' */
} D_Work_mcb_pmsm_foc_qep_dyno_f2;

/* Invariant block signals (default storage) */
typedef struct {
  const real_T IndexVector;            /* '<S447>/Index Vector' */
  const real_T IndexVector1;           /* '<S447>/Index Vector1' */
  const real_T IndexVector2;           /* '<S447>/Index Vector2' */
  const real_T IndexVector_g;          /* '<S463>/Index Vector' */
  const real_T IndexVector1_c;         /* '<S463>/Index Vector1' */
  const real_T Add;                    /* '<S463>/Add' */
  const real_T IndexVector_gf;         /* '<S464>/Index Vector' */
  const real_T IndexVector_gt;         /* '<S466>/Index Vector' */
  const real_T IndexVector_n;          /* '<S467>/Index Vector' */
  const real_T IndexVector2_m;         /* '<S467>/Index Vector2' */
  const real_T IndexVector_l;          /* '<S468>/Index Vector' */
  const real_T IndexVector_i;          /* '<S465>/Index Vector' */
  const real_T IndexVector_c;          /* '<S469>/Index Vector' */
  const real_T IndexVector_li;         /* '<S470>/Index Vector' */
  const real_T IndexVector1_m;         /* '<S470>/Index Vector1' */
  const real_T IndexVector_d;          /* '<S471>/Index Vector' */
  const real_T IndexVector_p;          /* '<S472>/Index Vector' */
  const real_T IndexVector_h;          /* '<S491>/Index Vector' */
  const real_T IndexVector1_cq;        /* '<S491>/Index Vector1' */
  const real_T Add_h;                  /* '<S491>/Add' */
  const real_T IndexVector_io;         /* '<S492>/Index Vector' */
  const real_T IndexVector_e;          /* '<S494>/Index Vector' */
  const real_T IndexVector_ei;         /* '<S495>/Index Vector' */
  const real_T IndexVector1_o;         /* '<S495>/Index Vector1' */
  const real_T IndexVector_ii;         /* '<S496>/Index Vector' */
  const real_T IndexVector_ng;         /* '<S493>/Index Vector' */
  const real_T IndexVector_b;          /* '<S497>/Index Vector' */
  const real_T IndexVector_ck;         /* '<S498>/Index Vector' */
  const real_T IndexVector1_k;         /* '<S498>/Index Vector1' */
  const real_T IndexVector_ds;         /* '<S499>/Index Vector' */
  const real_T IndexVector_f;          /* '<S500>/Index Vector' */
  const real32_T Ld_Port;              /* '<S421>/Gain' */
  const real32_T Switch;               /* '<S421>/Switch' */
  const real32_T Lq_Port;              /* '<S421>/Gain1' */
  const real32_T Switch1;              /* '<S421>/Switch1' */
  const real32_T FluxPM_Port;          /* '<S421>/Gain2' */
  const real32_T Switch2;              /* '<S421>/Switch2' */
  const real32_T Ld_Lq;                /* '<S420>/Subtract' */
  const real32_T Ld_Port_f;            /* '<S222>/Gain' */
  const real32_T Switch_c;             /* '<S222>/Switch' */
  const real32_T Lq_Port_h;            /* '<S222>/Gain1' */
  const real32_T Switch1_i;            /* '<S222>/Switch1' */
  const real32_T FluxPM_Port_d;        /* '<S222>/Gain2' */
  const real32_T Switch2_j;            /* '<S222>/Switch2' */
  const real32_T Ld_Lq_a;              /* '<S221>/Subtract' */
  const uint16_T Width;                /* '<S223>/Width' */
} ConstBlockIO_mcb_pmsm_foc_qep_d;

/* Constant parameters (default storage) */
typedef struct {
  /* Pooled Parameter (Expression: )
   * Referenced by:
   *   '<S34>/sine_table_values'
   *   '<S178>/sine_table_values'
   *   '<S245>/sine_table_values'
   */
  real32_T pooled29[1002];
} ConstParam_mcb_pmsm_foc_qep_dyn;

/* Real-time Model Data Structure */
struct tag_RTM_mcb_pmsm_foc_qep_dyno_f {
  const char_T * volatile errorStatus;

