tefilus/DATN_backup/SIMULINK/mcb_pmsm_foc_qep_dyno_f28069m_ert_rtw/mcb_pmsm_foc_qep_dyno_f28069m.h
  /*
   * Timing:
   * The following substructure contains information regarding
   * the timing information for the model.
   */
  struct {
    struct {
      uint16_T TID[3];
    } TaskCounters;
  } Timing;
};

/* Block signals (default storage) */
extern BlockIO_mcb_pmsm_foc_qep_dyno_f mcb_pmsm_foc_qep_dyno_f28069m_B;

/* Block states (default storage) */
extern D_Work_mcb_pmsm_foc_qep_dyno_f2 mcb_pmsm_foc_qep_dyno_f28_DWork;
extern const ConstBlockIO_mcb_pmsm_foc_qep_d mcb_pmsm_foc_qep_dyno_f2_ConstB;/* constant block i/o */

/* Constant parameters (default storage) */
extern const ConstParam_mcb_pmsm_foc_qep_dyn mcb_pmsm_foc_qep_dyno_f2_ConstP;

/* External function called from main */
extern void mcb_pmsm_foc_qep_dyno_f28069m_SetEventsForThisBaseStep(boolean_T
  *eventFlags);

/* Model entry point functions */
extern void mcb_pmsm_foc_qep_dyno_f28069m_initialize(void);
extern void mcb_pmsm_foc_qep_dyno_f28069m_step0(void);
extern void mcb_pmsm_foc_qep_dyno_f28069m_step1(void);
extern void mcb_pmsm_foc_qep_dyno_f28069m_step2(void);
extern void mcb_pmsm_foc_qep_dyno_f28069m_terminate(void);

/* Real-time Model object */
extern RT_MODEL_mcb_pmsm_foc_qep_dyno_ *const mcb_pmsm_foc_qep_dyno_f28069_M;
extern volatile boolean_T stopRequested;
extern volatile boolean_T runModel;

#ifdef __cpluscplus

extern "C"
{

#endif

  interrupt void ADCINT1(void);
  interrupt void ADCINT2(void);
  interrupt void SCIRXINTA(void);
  void mcb_pmsm_foc_qep_dyno_f28069m_configure_interrupts (void);
  void mcb_pmsm_foc_qep_dyno_f28069m_unconfigure_interrupts (void);

#ifdef __cpluscplus

}

#endif

/*-
 * The generated code includes comments that allow you to trace directly
 * back to the appropriate location in the model.  The basic format
 * is <system>/block_name, where system is the system number (uniquely
 * assigned by Simulink) and block_name is the name of the block.
 *
 * Use the MATLAB hilite_system command to trace the generated code back
 * to the model.  For example,
 *
 * hilite_system('<S3>')    - opens system 3
 * hilite_system('<S3>/Kp') - opens and selects block Kp which resides in S3
 *
 * Here is the system hierarchy for this model
 *
 * '<Root>' : 'mcb_pmsm_foc_qep_dyno_f28069m'
 * '<S1>'   : 'mcb_pmsm_foc_qep_dyno_f28069m/Code generation'
 * '<S2>'   : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1'
 * '<S3>'   : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2'
 * '<S4>'   : 'mcb_pmsm_foc_qep_dyno_f28069m/Hardware Init'
 * '<S5>'   : 'mcb_pmsm_foc_qep_dyno_f28069m/HeartBeat LED'
 * '<S6>'   : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled'
 * '<S7>'   : 'mcb_pmsm_foc_qep_dyno_f28069m/Serial Receive'
 * '<S8>'   : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1'
 * '<S9>'   : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Limit for motor2'
 * '<S10>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/Code generation/HWI_ADCINT1'
 * '<S11>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/Code generation/HWI_ADCINT2'
 * '<S12>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/Code generation/HWI_SCIRXINTA'
 * '<S13>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/Code generation/HWI_ADCINT1/ECSoC'
 * '<S14>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/Code generation/HWI_ADCINT1/ECSoC/ECSimCodegen'
 * '<S15>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/Code generation/HWI_ADCINT2/ECSoC'
 * '<S16>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/Code generation/HWI_ADCINT2/ECSoC/ECSimCodegen'
 * '<S17>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/Code generation/HWI_SCIRXINTA/ECSoC'
 * '<S18>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/Code generation/HWI_SCIRXINTA/ECSoC/ECSimCodegen'
 * '<S19>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System'
 * '<S20>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/HW_Inputs'
 * '<S21>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Input Scaling'
 * '<S22>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Inverter (Code Generation)'
 * '<S23>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Output Scaling'
 * '<S24>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/PMSM Torque Estimator1'
 * '<S25>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/SCI (Code Generation)'
 * '<S26>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Subsystem'
 * '<S27>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control'
 * '<S28>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Open Loop Start-Up'
 * '<S29>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control'
 * '<S30>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Clarke Transform'
 * '<S31>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers'
 * '<S32>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Inverse Park Transform'
 * '<S33>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Park Transform'
 * '<S34>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Sine-Cosine Lookup'
 * '<S35>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Space Vector Generator'
 * '<S36>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Clarke Transform/Two phase input'
 * '<S37>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Clarke Transform/Two phase input/Two phase CRL wrap'
 * '<S38>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/DQ Limiter'
 * '<S39>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id'
 * '<S40>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Iq'
 * '<S41>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/DQ Limiter/D-Q Equivalence'
 * '<S42>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/DQ Limiter/D//Q Axis Priority'
 * '<S43>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/DQ Limiter/Inport//Dialog Selection'
 * '<S44>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/DQ Limiter/Magnitude_calc'
 * '<S45>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/DQ Limiter/D-Q Equivalence/Limiter'
 * '<S46>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/DQ Limiter/D-Q Equivalence/Passthrough'
 * '<S47>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/DQ Limiter/D//Q Axis Priority/Compare To Constant'
 * '<S48>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/DQ Limiter/D//Q Axis Priority/Compare To Constant1'
 * '<S49>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/DQ Limiter/D//Q Axis Priority/flipInputs'
 * '<S50>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/DQ Limiter/D//Q Axis Priority/flipInputs1'
 * '<S51>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/DQ Limiter/D//Q Axis Priority/limiter'
 * '<S52>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/DQ Limiter/D//Q Axis Priority/limiter/limitRef1'
 * '<S53>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/DQ Limiter/D//Q Axis Priority/limiter/limitRef2'
 * '<S54>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/DQ Limiter/D//Q Axis Priority/limiter/passThrough'
 * '<S55>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset'
 * '<S56>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Anti-windup'
 * '<S57>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/D Gain'
 * '<S58>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Filter'
 * '<S59>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Filter ICs'
 * '<S60>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/I Gain'
 * '<S61>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Ideal P Gain'
 * '<S62>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk'
 * '<S63>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Integrator'
 * '<S64>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Integrator ICs'
 * '<S65>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/N Copy'
 * '<S66>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/N Gain'
 * '<S67>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/P Copy'
 * '<S68>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Parallel P Gain'
 * '<S69>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Reset Signal'
 * '<S70>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Saturation'
 * '<S71>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk'
 * '<S72>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Sum'
 * '<S73>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Sum Fdbk'
 * '<S74>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tracking Mode'
 * '<S75>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum'
 * '<S76>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral'
 * '<S77>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain'
 * '<S78>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/postSat Signal'
 * '<S79>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/preSat Signal'
 * '<S80>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel'
 * '<S81>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone'
 * '<S82>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone/Enabled'
 * '<S83>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/D Gain/Disabled'
 * '<S84>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Filter/Disabled'
 * '<S85>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Filter ICs/Disabled'
 * '<S86>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/I Gain/External Parameters'
 * '<S87>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Ideal P Gain/Passthrough'
 * '<S88>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk/Disabled'
 * '<S89>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Integrator/Discrete'
 * '<S90>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Integrator ICs/External IC'
 * '<S91>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/N Copy/Disabled wSignal Specification'
 * '<S92>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/N Gain/Disabled'
 * '<S93>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/P Copy/Disabled'
 * '<S94>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Parallel P Gain/External Parameters'
 * '<S95>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Reset Signal/External Reset'
 * '<S96>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Saturation/Enabled'
 * '<S97>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk/Disabled'
 * '<S98>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Sum/Sum_PI'
 * '<S99>'  : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Sum Fdbk/Disabled'
 * '<S100>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tracking Mode/Disabled'
 * '<S101>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum/Passthrough'
 * '<S102>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral/TsSignalSpecification'
 * '<S103>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain/Passthrough'
 * '<S104>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/postSat Signal/Forward_Path'
 * '<S105>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/preSat Signal/Forward_Path'
 * '<S106>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset'
 * '<S107>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Anti-windup'
 * '<S108>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/D Gain'
 * '<S109>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Filter'
 * '<S110>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Filter ICs'
 * '<S111>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/I Gain'
 * '<S112>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Ideal P Gain'
 * '<S113>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk'
 * '<S114>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Integrator'
 * '<S115>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Integrator ICs'
 * '<S116>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/N Copy'
 * '<S117>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/N Gain'
 * '<S118>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/P Copy'
 * '<S119>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Parallel P Gain'
 * '<S120>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Reset Signal'
 * '<S121>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Saturation'
 * '<S122>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk'
 * '<S123>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor1/Control_System/Closed loop Control/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Sum'
