tefilus/DATN_backup/SIMULINK/mcb_pmsm_foc_qep_dyno_f28069m_ert_rtw/mcb_pmsm_foc_qep_dyno_f28069m.h
 * '<S269>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Filter'
 * '<S270>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Filter ICs'
 * '<S271>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/I Gain'
 * '<S272>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Ideal P Gain'
 * '<S273>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk'
 * '<S274>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Integrator'
 * '<S275>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Integrator ICs'
 * '<S276>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/N Copy'
 * '<S277>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/N Gain'
 * '<S278>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/P Copy'
 * '<S279>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Parallel P Gain'
 * '<S280>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Reset Signal'
 * '<S281>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Saturation'
 * '<S282>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk'
 * '<S283>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Sum'
 * '<S284>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Sum Fdbk'
 * '<S285>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tracking Mode'
 * '<S286>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum'
 * '<S287>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral'
 * '<S288>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain'
 * '<S289>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/postSat Signal'
 * '<S290>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/preSat Signal'
 * '<S291>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel'
 * '<S292>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone'
 * '<S293>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone/Enabled'
 * '<S294>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/D Gain/Disabled'
 * '<S295>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Filter/Disabled'
 * '<S296>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Filter ICs/Disabled'
 * '<S297>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/I Gain/External Parameters'
 * '<S298>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Ideal P Gain/Passthrough'
 * '<S299>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk/Disabled'
 * '<S300>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Integrator/Discrete'
 * '<S301>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Integrator ICs/External IC'
 * '<S302>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/N Copy/Disabled wSignal Specification'
 * '<S303>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/N Gain/Disabled'
 * '<S304>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/P Copy/Disabled'
 * '<S305>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Parallel P Gain/External Parameters'
 * '<S306>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Reset Signal/External Reset'
 * '<S307>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Saturation/Enabled'
 * '<S308>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk/Disabled'
 * '<S309>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Sum/Sum_PI'
 * '<S310>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Sum Fdbk/Disabled'
 * '<S311>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tracking Mode/Disabled'
 * '<S312>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum/Passthrough'
 * '<S313>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral/TsSignalSpecification'
 * '<S314>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain/Passthrough'
 * '<S315>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/postSat Signal/Forward_Path'
 * '<S316>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/preSat Signal/Forward_Path'
 * '<S317>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset'
 * '<S318>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Anti-windup'
 * '<S319>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/D Gain'
 * '<S320>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Filter'
 * '<S321>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Filter ICs'
 * '<S322>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/I Gain'
 * '<S323>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Ideal P Gain'
 * '<S324>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk'
 * '<S325>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Integrator'
 * '<S326>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Integrator ICs'
 * '<S327>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/N Copy'
 * '<S328>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/N Gain'
 * '<S329>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/P Copy'
 * '<S330>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Parallel P Gain'
 * '<S331>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Reset Signal'
 * '<S332>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Saturation'
 * '<S333>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk'
 * '<S334>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Sum'
 * '<S335>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Sum Fdbk'
 * '<S336>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tracking Mode'
 * '<S337>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum'
 * '<S338>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral'
 * '<S339>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain'
 * '<S340>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/postSat Signal'
 * '<S341>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/preSat Signal'
 * '<S342>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel'
 * '<S343>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone'
 * '<S344>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone/Enabled'
 * '<S345>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/D Gain/Disabled'
 * '<S346>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Filter/Disabled'
 * '<S347>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Filter ICs/Disabled'
 * '<S348>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/I Gain/External Parameters'
 * '<S349>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Ideal P Gain/Passthrough'
 * '<S350>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk/Disabled'
 * '<S351>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Integrator/Discrete'
 * '<S352>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Integrator ICs/External IC'
 * '<S353>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/N Copy/Disabled wSignal Specification'
 * '<S354>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/N Gain/Disabled'
 * '<S355>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/P Copy/Disabled'
 * '<S356>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Parallel P Gain/External Parameters'
 * '<S357>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Reset Signal/External Reset'
 * '<S358>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Saturation/Enabled'
 * '<S359>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk/Disabled'
 * '<S360>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Sum/Sum_PI'
 * '<S361>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Sum Fdbk/Disabled'
 * '<S362>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tracking Mode/Disabled'
 * '<S363>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum/Passthrough'
 * '<S364>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral/TsSignalSpecification'
 * '<S365>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain/Passthrough'
 * '<S366>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/postSat Signal/Forward_Path'
 * '<S367>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/preSat Signal/Forward_Path'
 * '<S368>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Inverse Park Transform/Two inputs CRL'
 * '<S369>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Inverse Park Transform/Two inputs CRL/Switch_Axis'
 * '<S370>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Park Transform/Two inputs CRL'
 * '<S371>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Park Transform/Two inputs CRL/Switch_Axis'
 * '<S372>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Sine-Cosine Lookup/Interpolation'
 * '<S373>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Sine-Cosine Lookup/WrapUp'
 * '<S374>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Sine-Cosine Lookup/WrapUp/Compare To Zero'
 * '<S375>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Sine-Cosine Lookup/WrapUp/If Action Subsystem'
 * '<S376>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Sine-Cosine Lookup/WrapUp/If Action Subsystem1'
 * '<S377>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Space Vector Generator/Modulation method'
 * '<S378>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Space Vector Generator/Voltage Input'
 * '<S379>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Space Vector Generator/Modulation method/SVPWM'
 * '<S380>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Space Vector Generator/Modulation method/SVPWM/Half(Vmin+Vmax)'
 * '<S381>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Space Vector Generator/Voltage Input/Valphabeta'
 * '<S382>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Space Vector Generator/Voltage Input/Valphabeta/Inverse Clarke Transform'
 * '<S383>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Control_System/Closed loop/Current Control/Space Vector Generator/Voltage Input/Valphabeta/Inverse Clarke Transform/Two phase input'
 * '<S384>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Enable Motor2 after a delay/Delay to start motor1 (codegen)'
