tefilus/DATN_backup/SIMULINK/mcb_pmsm_foc_qep_dyno_f28069m_ert_rtw/mcb_pmsm_foc_qep_dyno_f28069m.h
 * '<S385>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Enable Motor2 after a delay/Delay to start motor1 (codegen)/Disable EnMtr2TrqCtrl'
 * '<S386>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Enable Motor2 after a delay/Delay to start motor1 (codegen)/Enable EnMtr2TrqCtrl after 2 sec delay'
 * '<S387>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Enable Motor2 after a delay/Delay to start motor1 (codegen)/Enable EnMtr2TrqCtrl after 2 sec delay/Enable EnMtr2TrqCtrl'
 * '<S388>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/HW_Inputs1/Sensor Driver Blocks (codegen)'
 * '<S389>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed'
 * '<S390>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/Calculate Phase Currents'
 * '<S391>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/IIR Filter'
 * '<S392>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/IndexFinder'
 * '<S393>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/Mechanical to Electrical Position'
 * '<S394>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/Quadrature Decoder'
 * '<S395>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/Speed Measurement'
 * '<S396>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/IIR Filter/IIR Filter'
 * '<S397>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/IIR Filter/IIR Filter/Low-pass'
 * '<S398>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/IIR Filter/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S399>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/IndexFinder/Compare To Constant'
 * '<S400>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/IndexFinder/Compare To Constant1'
 * '<S401>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/Mechanical to Electrical Position/MechToElec'
 * '<S402>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/Mechanical to Electrical Position/MechToElec/floating-point'
 * '<S403>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/Mechanical to Electrical Position/MechToElec/floating-point/Compensate Offset'
 * '<S404>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/Mechanical to Electrical Position/MechToElec/floating-point/Mech To Elec'
 * '<S405>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/Mechanical to Electrical Position/MechToElec/floating-point/Compensate Offset/If Action Subsystem'
 * '<S406>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/Mechanical to Electrical Position/MechToElec/floating-point/Compensate Offset/If Action Subsystem1'
 * '<S407>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/Mechanical to Electrical Position/MechToElec/floating-point/Mech To Elec/Variant Subsystem'
 * '<S408>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/Mechanical to Electrical Position/MechToElec/floating-point/Mech To Elec/Variant Subsystem/Dialog'
 * '<S409>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/Quadrature Decoder/DT_Handle'
 * '<S410>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/Quadrature Decoder/PositionNoReset'
 * '<S411>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/Quadrature Decoder/PositionResetAtIndex'
 * '<S412>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/Quadrature Decoder/Variant Subsystem'
 * '<S413>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/Quadrature Decoder/DT_Handle/floating-point'
 * '<S414>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/Quadrature Decoder/PositionNoReset/Variant Subsystem'
 * '<S415>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/Quadrature Decoder/PositionNoReset/Variant Subsystem/Dialog'
 * '<S416>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/Quadrature Decoder/Variant Subsystem/Dialog'
 * '<S417>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/Speed Measurement/DT_Handle'
 * '<S418>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/Input Scaling/ Calculate Speed/Speed Measurement/DT_Handle/floating-point'
 * '<S419>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/PMSM Torque Estimator1/Variant Subsystem'
 * '<S420>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/PMSM Torque Estimator1/Variant Subsystem/Torque Estimator_LumpedParameters_InputPort'
 * '<S421>' : 'mcb_pmsm_foc_qep_dyno_f28069m/FOC Algorithm Motor2/PMSM Torque Estimator1/Variant Subsystem/Torque Estimator_LumpedParameters_InputPort/LumpedParams_InputPorts'
 * '<S422>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Hardware Init/HW_Init'
 * '<S423>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Hardware Init/HW_Init/HW_Init (Codegen)'
 * '<S424>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 1 current sensor'
 * '<S425>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 2 current sensor'
 * '<S426>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Hardware Init/HW_Init/HW_Init (Codegen)/Enable DRV8305 for motor 1 and motor 2'
 * '<S427>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 1 current sensor/Calculate ADC Offset'
 * '<S428>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 1 current sensor/Default ADC Offset'
 * '<S429>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 1 current sensor/Calculate ADC Offset/For Iterator Subsystem'
 * '<S430>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 1 current sensor/Calculate ADC Offset/If Action Subsystem'
 * '<S431>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 1 current sensor/Calculate ADC Offset/If Action Subsystem1'
 * '<S432>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 1 current sensor/Calculate ADC Offset/If Action Subsystem2'
 * '<S433>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 1 current sensor/Calculate ADC Offset/If Action Subsystem3'
 * '<S434>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 1 current sensor/Calculate ADC Offset/For Iterator Subsystem/If Action Subsystem'
 * '<S435>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 2 current sensor/Calculate ADC Offset'
 * '<S436>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 2 current sensor/Default ADC Offset'
 * '<S437>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 2 current sensor/Calculate ADC Offset/For Iterator Subsystem'
 * '<S438>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 2 current sensor/Calculate ADC Offset/If Action Subsystem4'
 * '<S439>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 2 current sensor/Calculate ADC Offset/If Action Subsystem5'
 * '<S440>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 2 current sensor/Calculate ADC Offset/If Action Subsystem6'
 * '<S441>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 2 current sensor/Calculate ADC Offset/If Action Subsystem7'
 * '<S442>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Hardware Init/HW_Init/HW_Init (Codegen)/Calibrate ADC offset for motor 2 current sensor/Calculate ADC Offset/For Iterator Subsystem/If Action Subsystem1'
 * '<S443>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control'
 * '<S444>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control'
 * '<S445>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete'
 * '<S446>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete'
 * '<S447>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/Mechanical and Angle'
 * '<S448>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/Motor Units1'
 * '<S449>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic'
 * '<S450>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/Mechanical and Angle/Int1'
 * '<S451>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/Mechanical and Angle/Int1/Compare To Constant'
 * '<S452>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/Mechanical and Angle/Int1/Compare To Constant1'
 * '<S453>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/Motor Units1/Power Accounting Bus Creator'
 * '<S454>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/Motor Units1/Power Accounting Bus Creator/PwrNotTrnsfrd Input'
 * '<S455>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/Motor Units1/Power Accounting Bus Creator/PwrStored Input'
 * '<S456>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/Motor Units1/Power Accounting Bus Creator/PwrTrnsfrd Input'
 * '<S457>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/Clarke Transform'
 * '<S458>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/Inverse Clarke Transform'
 * '<S459>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/Inverse Park Transform'
 * '<S460>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/Machine Torque'
 * '<S461>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit'
 * '<S462>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/Park Transform'
 * '<S463>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/Machine Torque/Subsystem'
 * '<S464>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/D Axis Stator Voltage'
 * '<S465>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/Q Axis Stator Voltage'
 * '<S466>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/D Axis Stator Voltage/Subsystem'
 * '<S467>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/D Axis Stator Voltage/Subsystem1'
 * '<S468>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/D Axis Stator Voltage/Subsystem2'
 * '<S469>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/Q Axis Stator Voltage/Subsystem'
 * '<S470>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/Q Axis Stator Voltage/Subsystem1'
 * '<S471>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/Q Axis Stator Voltage/Subsystem2'
 * '<S472>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 1 - Speed control/PMSM Torque Input Exterior Discrete/PMSM Torque Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/Q Axis Stator Voltage/Subsystem3'
 * '<S473>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete'
 * '<S474>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete'
 * '<S475>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/Mechanical and Angle'
 * '<S476>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/Motor Units1'
 * '<S477>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic'
 * '<S478>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/Mechanical and Angle/Int'
 * '<S479>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/Mechanical and Angle/Int/Compare To Constant'
 * '<S480>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/Mechanical and Angle/Int/Compare To Constant1'
 * '<S481>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/Motor Units1/Power Accounting Bus Creator'
 * '<S482>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/Motor Units1/Power Accounting Bus Creator/PwrNotTrnsfrd Input'
 * '<S483>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/Motor Units1/Power Accounting Bus Creator/PwrStored Input'
 * '<S484>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/Motor Units1/Power Accounting Bus Creator/PwrTrnsfrd Input'
 * '<S485>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/Clarke Transform'
 * '<S486>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/Inverse Clarke Transform'
 * '<S487>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/Inverse Park Transform'
 * '<S488>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/Machine Torque'
 * '<S489>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit'
 * '<S490>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/Park Transform'
 * '<S491>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/Machine Torque/Subsystem'
 * '<S492>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/D Axis Stator Voltage'
 * '<S493>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/Q Axis Stator Voltage'
 * '<S494>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/D Axis Stator Voltage/Subsystem'
 * '<S495>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/D Axis Stator Voltage/Subsystem1'
 * '<S496>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/D Axis Stator Voltage/Subsystem2'
 * '<S497>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/Q Axis Stator Voltage/Subsystem'
 * '<S498>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/Q Axis Stator Voltage/Subsystem1'
 * '<S499>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/Q Axis Stator Voltage/Subsystem2'
 * '<S500>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Motor1 and Motor2 coupled/Motor 2 - Torque control/PMSM Speed Input Exterior Discrete/PMSM Speed Input Core Discrete/PMSM Electromagnetic/PMSM Equivalent Circuit/Q Axis Stator Voltage/Subsystem3'
 * '<S501>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Serial Receive/Code Generation'
 * '<S502>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Serial Receive/Reference Signal'
 * '<S503>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Serial Receive/Reference Signal/Data_Conditioning'
 * '<S504>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Serial Receive/Reference Signal/If Action Subsystem'
 * '<S505>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Serial Receive/Reference Signal/If Action Subsystem1'
 * '<S506>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Serial Receive/Reference Signal/If Action Subsystem2'
 * '<S507>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Serial Receive/Reference Signal/unParse'
 * '<S508>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed'
 * '<S509>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/Speed_Ref_Selector'
 * '<S510>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset'
 * '<S511>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Anti-windup'
 * '<S512>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/D Gain'
 * '<S513>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter'
 * '<S514>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter ICs'
 * '<S515>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/I Gain'
 * '<S516>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain'
 * '<S517>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk'
 * '<S518>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator'
 * '<S519>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator ICs'
 * '<S520>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Copy'
 * '<S521>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Gain'
 * '<S522>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/P Copy'
 * '<S523>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Parallel P Gain'
 * '<S524>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Reset Signal'
 * '<S525>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation'
