tefilus/DATN_backup/SIMULINK/mcb_pmsm_foc_qep_dyno_f28069m_ert_rtw/mcb_pmsm_foc_qep_dyno_f28069m.h
 * '<S526>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk'
 * '<S527>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum'
 * '<S528>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum Fdbk'
 * '<S529>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode'
 * '<S530>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum'
 * '<S531>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral'
 * '<S532>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain'
 * '<S533>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/postSat Signal'
 * '<S534>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/preSat Signal'
 * '<S535>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel'
 * '<S536>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone'
 * '<S537>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone/Enabled'
 * '<S538>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/D Gain/Disabled'
 * '<S539>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter/Disabled'
 * '<S540>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter ICs/Disabled'
 * '<S541>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/I Gain/External Parameters'
 * '<S542>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain/Passthrough'
 * '<S543>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk/Disabled'
 * '<S544>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator/Discrete'
 * '<S545>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator ICs/External IC'
 * '<S546>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Copy/Disabled wSignal Specification'
 * '<S547>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Gain/Disabled'
 * '<S548>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/P Copy/Disabled'
 * '<S549>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Parallel P Gain/External Parameters'
 * '<S550>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Reset Signal/External Reset'
 * '<S551>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation/Enabled'
 * '<S552>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk/Disabled'
 * '<S553>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum/Sum_PI'
 * '<S554>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum Fdbk/Disabled'
 * '<S555>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode/Disabled'
 * '<S556>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum/Passthrough'
 * '<S557>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral/TsSignalSpecification'
 * '<S558>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain/Passthrough'
 * '<S559>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/postSat Signal/Forward_Path'
 * '<S560>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/preSat Signal/Forward_Path'
 * '<S561>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/Speed_Ref_Selector/IIR Filter'
 * '<S562>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/Speed_Ref_Selector/IIR Filter/IIR Filter'
 * '<S563>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/Speed_Ref_Selector/IIR Filter/IIR Filter/Low-pass'
 * '<S564>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Control for motor1/Speed_Ref_Selector/IIR Filter/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S565>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Limit for motor2/IIR Filter'
 * '<S566>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Limit for motor2/IIR Filter/IIR Filter'
 * '<S567>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Limit for motor2/IIR Filter/IIR Filter/Low-pass'
 * '<S568>' : 'mcb_pmsm_foc_qep_dyno_f28069m/Speed Limit for motor2/IIR Filter/IIR Filter/Low-pass/IIR Low Pass Filter'
 */
#endif                         /* RTW_HEADER_mcb_pmsm_foc_qep_dyno_f28069m_h_ */

/*
 * File trailer for generated code.
 *
 * [EOF]
 */
